## repositories plan
```
data.github_team.test_team_access: Reading...
module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.test_tamf_repo_test_org.github_repository_tag_protection.default: Refreshing state... [id=170153]
data.github_team.operations_engineering_test: Reading...
module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.test_tamf_repo_2.github_repository_tag_protection.default: Refreshing state... [id=170152]
module.ministryofjustice.module.terraform-template-poc.github_repository.default: Refreshing state... [id=terraform-template-poc]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
module.ministryofjustice.module.github.github_repository.default: Refreshing state... [id=.github]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
data.github_team.operations_engineering_test: Read complete after 3s [id=9456244]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
data.github_team.test_team_access: Read complete after 3s [id=9472191]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOFbeyoM4CwGtg]
module.ministryofjustice.module.github.github_repository_tag_protection.default: Refreshing state... [id=164900]
module.ministryofjustice.module.github.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_repository_tag_protection.default: Refreshing state... [id=168994]
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
data.github_team.operations_engineering: Read complete after 4s [id=4192115]
module.ministryofjustice.module.terraform-template-poc.github_repository_tag_protection.default: Refreshing state... [id=165190]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-template-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOJKjnDs4CwPiD]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository_tag_protection.default: Refreshing state... [id=172607]
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_repository_tag_protection.default: Refreshing state... [id=164898]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository_tag_protection.default: Refreshing state... [id=164899]
module.ministryofjustice.module.terraform-template-poc.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default: Refreshing state... [id=165168]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository_tag_protection.default: Refreshing state... [id=165187]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository_tag_protection.default: Refreshing state... [id=165171]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository_tag_protection.default: Refreshing state... [id=164706]
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository_tag_protection.default: Refreshing state... [id=164896]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository_tag_protection.default: Refreshing state... [id=165176]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository_tag_protection.default: Refreshing state... [id=165175]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.github_repository_tag_protection.default: Refreshing state... [id=165173]
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_repository_tag_protection.default: Refreshing state... [id=165170]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.github_repository_tag_protection.default: Refreshing state... [id=165189]
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_repository_tag_protection.default: Refreshing state... [id=164897]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.github_repository_tag_protection.default: Refreshing state... [id=165192]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 2s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-monitor.github_repository_tag_protection.default: Refreshing state... [id=165188]
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering.github_repository_tag_protection.default: Refreshing state... [id=165184]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_repository_tag_protection.default: Refreshing state... [id=165169]
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.template-documentation-site.github_repository_tag_protection.default: Refreshing state... [id=165193]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.terraform-github-repository.github_repository_tag_protection.default: Refreshing state... [id=166200]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.template-repository.github_repository_tag_protection.default: Refreshing state... [id=165191]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.acronyms.github_repository_tag_protection.default: Refreshing state... [id=164902]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository_tag_protection.default: Refreshing state... [id=165174]
module.ministryofjustice.module.github-actions.github_repository_tag_protection.default: Refreshing state... [id=164901]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:.github]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.terraform-template-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-template-poc]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.test_tamf_repo_2.github_branch_protection.default will be destroyed
  # (because github_branch_protection.default is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOLRPf1s4Cyrgn" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "test-tamf-repo-2" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = true -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [] -> null
          - strict   = false -> null
        }
    }

  # module.test_tamf_repo_2.github_repository.default will be destroyed
  # (because github_repository.default is not in configuration)
  - resource "github_repository" "default" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform" -> null
      - etag                        = "W/\"7f11d3fe4a4d16e130244777921cc8c149888abcd6e7509268ae822d8ec208e6\"" -> null
      - full_name                   = "ministryofjustice/test-tamf-repo-2" -> null
      - git_clone_url               = "git://github.com/ministryofjustice/test-tamf-repo-2.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
      - html_url                    = "https://github.com/ministryofjustice/test-tamf-repo-2" -> null
      - http_clone_url              = "https://github.com/ministryofjustice/test-tamf-repo-2.git" -> null
      - id                          = "test-tamf-repo-2" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "test-tamf-repo-2" -> null
      - node_id                     = "R_kgDOLRPf1g" -> null
      - private                     = false -> null
      - repo_id                     = 756277206 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:ministryofjustice/test-tamf-repo-2.git" -> null
      - svn_url                     = "https://github.com/ministryofjustice/test-tamf-repo-2" -> null
      - topics                      = [
          - "operations-engineering",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "ministryofjustice" -> null
          - repository           = "template-repository" -> null
        }
    }

  # module.test_tamf_repo_2.github_repository_tag_protection.default will be destroyed
  # (because github_repository_tag_protection.default is not in configuration)
  - resource "github_repository_tag_protection" "default" {
      - id         = "170152" -> null
      - pattern    = "*" -> null
      - repository = "test-tamf-repo-2" -> null
    }

  # module.test_tamf_repo_2.github_team_repository.maintain["4192115"] will be destroyed
  # (because github_team_repository.maintain is not in configuration)
  - resource "github_team_repository" "maintain" {
      - etag       = "W/\"96a078b0829bb87122ca956e29858eeeda38cd0d7bbfbfaf40207572c39a60ab\"" -> null
      - id         = "4192115:test-tamf-repo-2" -> null
      - permission = "maintain" -> null
      - repository = "test-tamf-repo-2" -> null
      - team_id    = "4192115" -> null
    }

  # module.test_tamf_repo_test_org.github_branch_protection.default will be destroyed
  # (because github_branch_protection.default is not in configuration)
  - resource "github_branch_protection" "default" {
      - allows_deletions                = false -> null
      - allows_force_pushes             = false -> null
      - blocks_creations                = false -> null
      - enforce_admins                  = true -> null
      - force_push_bypassers            = [] -> null
      - id                              = "BPR_kwDOLRPf2c4Cyrgo" -> null
      - lock_branch                     = false -> null
      - pattern                         = "main" -> null
      - push_restrictions               = [] -> null
      - repository_id                   = "test-tamf-repo-test-org" -> null
      - require_conversation_resolution = false -> null
      - require_signed_commits          = false -> null
      - required_linear_history         = false -> null

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = true -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = true -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      - required_status_checks {
          - contexts = [] -> null
          - strict   = false -> null
        }
    }

  # module.test_tamf_repo_test_org.github_repository.default will be destroyed
  # (because github_repository.default is not in configuration)
  - resource "github_repository" "default" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform" -> null
      - etag                        = "W/\"f91fe04b9338bea519571a5da2e585e8e12a5cda99b92d36c770e79cfe2e060a\"" -> null
      - full_name                   = "ministryofjustice-test/test-tamf-repo-test-org" -> null
      - git_clone_url               = "git://github.com/ministryofjustice-test/test-tamf-repo-test-org.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = true -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = true -> null
      - html_url                    = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org" -> null
      - http_clone_url              = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org.git" -> null
      - id                          = "test-tamf-repo-test-org" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "test-tamf-repo-test-org" -> null
      - node_id                     = "R_kgDOLRPf2Q" -> null
      - private                     = false -> null
      - repo_id                     = 756277209 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:ministryofjustice-test/test-tamf-repo-test-org.git" -> null
      - svn_url                     = "https://github.com/ministryofjustice-test/test-tamf-repo-test-org" -> null
      - topics                      = [
          - "operations-engineering",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }

      - template {
          - include_all_branches = false -> null
          - owner                = "ministryofjustice" -> null
          - repository           = "template-repository" -> null
        }
    }

  # module.test_tamf_repo_test_org.github_repository_tag_protection.default will be destroyed
  # (because github_repository_tag_protection.default is not in configuration)
  - resource "github_repository_tag_protection" "default" {
      - id         = "170153" -> null
      - pattern    = "*" -> null
      - repository = "test-tamf-repo-test-org" -> null
    }

  # module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"] will be destroyed
  # (because github_team_repository.maintain is not in configuration)
  - resource "github_team_repository" "maintain" {
      - etag       = "W/\"1977724ec09e2becd44c909250adbe8d4117d8204694960d0140edb2e2fcf9cb\"" -> null
      - id         = "9456244:test-tamf-repo-test-org" -> null
      - permission = "maintain" -> null
      - repository = "test-tamf-repo-test-org" -> null
      - team_id    = "9456244" -> null
    }

  # module.test_tamf_repo_test_org.github_team_repository.push["9472191"] will be destroyed
  # (because github_team_repository.push is not in configuration)
  - resource "github_team_repository" "push" {
      - etag       = "W/\"9eb1a606e88680b96d9117233a223ea8ce030d179c9998987a898bae04f9f1db\"" -> null
      - id         = "9472191:test-tamf-repo-test-org" -> null
      - permission = "push" -> null
      - repository = "test-tamf-repo-test-org" -> null
      - team_id    = "9472191" -> null
    }

  # module.acronyms.github_branch_protection.default has moved to module.ministryofjustice.module.acronyms.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDODR2mI84CwGtl"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acronyms.github_repository.default has moved to module.ministryofjustice.module.acronyms.github_repository.default
    resource "github_repository" "default" {
        id                          = "acronyms"
        name                        = "acronyms"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.acronyms.github_repository_tag_protection.default has moved to module.ministryofjustice.module.acronyms.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164902"
        # (2 unchanged attributes hidden)
    }

  # module.acronyms.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:acronyms"
        # (4 unchanged attributes hidden)
    }

  # module.cloud-platform-maintenance-pages.github_branch_protection.default has moved to module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEeVbDs4CwGth"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cloud-platform-maintenance-pages.github_repository.default has moved to module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default
    resource "github_repository" "default" {
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cloud-platform-maintenance-pages.github_repository_tag_protection.default has moved to module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164899"
        # (2 unchanged attributes hidden)
    }

  # module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:cloud-platform-maintenance-pages"
        # (4 unchanged attributes hidden)
    }

  # module.github.github_branch_protection.default has moved to module.ministryofjustice.module.github.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOFbeyoM4CwGtg"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github.github_repository.default has moved to module.ministryofjustice.module.github.github_repository.default
    resource "github_repository" "default" {
        id                          = ".github"
        name                        = ".github"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.github.github_repository_tag_protection.default has moved to module.ministryofjustice.module.github.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164900"
        # (2 unchanged attributes hidden)
    }

  # module.github.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.github.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:.github"
        # (4 unchanged attributes hidden)
    }

  # module.github-actions.github_branch_protection.default has moved to module.ministryofjustice.module.github-actions.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDODNFKOs4CwGtk"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-actions.github_repository.default has moved to module.ministryofjustice.module.github-actions.github_repository.default
    resource "github_repository" "default" {
        id                          = "github-actions"
        name                        = "github-actions"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-actions.github_repository_tag_protection.default has moved to module.ministryofjustice.module.github-actions.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164901"
        # (2 unchanged attributes hidden)
    }

  # module.github-actions.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:github-actions"
        # (4 unchanged attributes hidden)
    }

  # module.github-collaborators.github_branch_protection.default has moved to module.ministryofjustice.module.github-collaborators.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEoQScc4CwGtd"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-collaborators.github_repository.default has moved to module.ministryofjustice.module.github-collaborators.github_repository.default
    resource "github_repository" "default" {
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.github-collaborators.github_repository_tag_protection.default has moved to module.ministryofjustice.module.github-collaborators.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164898"
        # (2 unchanged attributes hidden)
    }

  # module.github-collaborators.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:github-collaborators"
        # (4 unchanged attributes hidden)
    }

  # module.moj-terraform-aws-sso.github_branch_protection.default has moved to module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEYOl7c4CwGtj"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.moj-terraform-aws-sso.github_repository.default has moved to module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default
    resource "github_repository" "default" {
        id                          = "moj-terraform-aws-sso"
        name                        = "moj-terraform-aws-sso"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.moj-terraform-aws-sso.github_repository_tag_protection.default has moved to module.ministryofjustice.module.moj-terraform-aws-sso.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164896"
        # (2 unchanged attributes hidden)
    }

  # module.moj-terraform-aws-sso.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:moj-terraform-aws-sso"
        # (4 unchanged attributes hidden)
    }

  # module.moj-terraform-scim-github.github_branch_protection.default has moved to module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEoPJ8s4CwGtf"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.moj-terraform-scim-github.github_repository.default has moved to module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default
    resource "github_repository" "default" {
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.moj-terraform-scim-github.github_repository_tag_protection.default has moved to module.ministryofjustice.module.moj-terraform-scim-github.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164897"
        # (2 unchanged attributes hidden)
    }

  # module.moj-terraform-scim-github.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:moj-terraform-scim-github"
        # (4 unchanged attributes hidden)
    }

  # module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default will be read during apply
  # (depends on a resource or a module with changes pending)
  # (moved from module.operations-engineering.data.github_actions_public_key.default)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = "operations-engineering"
    }

  # module.operations-engineering.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDODVCV0c4CwPYY"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default will be updated in-place
  # (moved from module.operations-engineering.github_repository.default)
  ~ resource "github_repository" "default" {
        id                          = "operations-engineering"
        name                        = "operations-engineering"
      ~ vulnerability_alerts        = false -> true
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165184"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-certificate-renewal.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOI-Hjhc4CwPF_"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-certificate-renewal.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-certificate-renewal.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165171"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-certificate-renewal"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-devcontainer.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOLCkQts4Cv-3X"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-devcontainer.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-devcontainer"
        name                        = "operations-engineering-devcontainer"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-devcontainer.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-devcontainer.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "164706"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-devcontainer.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-devcontainer"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-documentation-browser-extension.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOK636CM4CwPF8"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-documentation-browser-extension.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-documentation-browser-extension"
        name                        = "operations-engineering-documentation-browser-extension"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165168"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-documentation-browser-extension"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-example:DEVELOPMENT_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-example:PRODUCTION_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-example:PRODUCTION_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOKnX9OM4CwPGH"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-example.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-example.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-example.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-example.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165173"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-example.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-example"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:DEV_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:DEV_ECR_REGISTRY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:DEV_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:PROD_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:PROD_ECR_REGISTRY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-join-github:PROD_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOKeC4ns4CwPGB"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-join-github.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-join-github.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-join-github.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-join-github.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165170"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-join-github.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-join-github"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"] has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-metadata-poc:ECR_REGISTRY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-metadata-poc.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOKeC3Jc4CwPGL"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-metadata-poc.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-metadata-poc"
        name                        = "operations-engineering-metadata-poc"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-metadata-poc.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165174"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-metadata-poc"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-reports:DEVELOPMENT_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-reports:ECR_REGISTRY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-reports:PRODUCTION_ECR_REGION"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]
    resource "github_actions_variable" "default" {
        id            = "operations-engineering-reports:PRODUCTION_ECR_REPOSITORY"
        # (5 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEpRCis4CwPF-"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-reports.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-reports.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-reports.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-reports.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165169"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-reports.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-reports"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-runbooks.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOKK8OCc4CwPGM"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-runbooks.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (37 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.operations-engineering-runbooks.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-runbooks.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165175"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-runbooks.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-runbooks"
        # (4 unchanged attributes hidden)
    }

  # module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default will be updated in-place
  # (moved from module.operations-engineering-support-metadata.github_branch_protection.default)
  ~ resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOLWBtds4Cz8XQ"
        # (12 unchanged attributes hidden)

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

        # (1 unchanged block hidden)
    }

  # module.operations-engineering-support-metadata.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-support-metadata"
        name                        = "operations-engineering-support-metadata"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-support-metadata.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-support-metadata.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "172607"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-support-metadata.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-support-metadata"
        # (4 unchanged attributes hidden)
    }

  # module.operations-engineering-user-guide.github_branch_protection.default has moved to module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOKCGhm84CwPGO"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.operations-engineering-user-guide.github_repository.default has moved to module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default
    resource "github_repository" "default" {
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (37 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.operations-engineering-user-guide.github_repository_tag_protection.default has moved to module.ministryofjustice.module.operations-engineering-user-guide.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165176"
        # (2 unchanged attributes hidden)
    }

  # module.operations-engineering-user-guide.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:operations-engineering-user-guide"
        # (4 unchanged attributes hidden)
    }

  # module.tech-docs-github-pages-publisher.github_branch_protection.default has moved to module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOE7RAx84CwPh_"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tech-docs-github-pages-publisher.github_repository.default has moved to module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default
    resource "github_repository" "default" {
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tech-docs-github-pages-publisher.github_repository_tag_protection.default has moved to module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165187"
        # (2 unchanged attributes hidden)
    }

  # module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:tech-docs-github-pages-publisher"
        # (4 unchanged attributes hidden)
    }

  # module.tech-docs-monitor.github_branch_protection.default has moved to module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHQFa_s4CwPiA"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.tech-docs-monitor.github_repository.default has moved to module.ministryofjustice.module.tech-docs-monitor.github_repository.default
    resource "github_repository" "default" {
        id                          = "tech-docs-monitor"
        name                        = "tech-docs-monitor"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tech-docs-monitor.github_repository_tag_protection.default has moved to module.ministryofjustice.module.tech-docs-monitor.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165188"
        # (2 unchanged attributes hidden)
    }

  # module.tech-docs-monitor.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:tech-docs-monitor"
        # (4 unchanged attributes hidden)
    }

  # module.technical-guidance.github_branch_protection.default has moved to module.ministryofjustice.module.technical-guidance.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOBeUD0s4CwPiB"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.technical-guidance.github_repository.default has moved to module.ministryofjustice.module.technical-guidance.github_repository.default
    resource "github_repository" "default" {
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (37 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.technical-guidance.github_repository_tag_protection.default has moved to module.ministryofjustice.module.technical-guidance.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165189"
        # (2 unchanged attributes hidden)
    }

  # module.technical-guidance.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:technical-guidance"
        # (4 unchanged attributes hidden)
    }

  # module.template-documentation-site.github_branch_protection.default has moved to module.ministryofjustice.module.template-documentation-site.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOEQGgTs4CwPiI"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.template-documentation-site.github_repository.default has moved to module.ministryofjustice.module.template-documentation-site.github_repository.default
    resource "github_repository" "default" {
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (37 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.template-documentation-site.github_repository_tag_protection.default has moved to module.ministryofjustice.module.template-documentation-site.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165193"
        # (2 unchanged attributes hidden)
    }

  # module.template-documentation-site.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:template-documentation-site"
        # (4 unchanged attributes hidden)
    }

  # module.template-repository.github_branch_protection.default has moved to module.ministryofjustice.module.template-repository.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDODYkhA84CwPiC"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.template-repository.github_repository.default has moved to module.ministryofjustice.module.template-repository.github_repository.default
    resource "github_repository" "default" {
        id                          = "template-repository"
        name                        = "template-repository"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.template-repository.github_repository_tag_protection.default has moved to module.ministryofjustice.module.template-repository.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165191"
        # (2 unchanged attributes hidden)
    }

  # module.template-repository.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:template-repository"
        # (4 unchanged attributes hidden)
    }

  # module.terraform-aws-mtasts.github_branch_protection.default has moved to module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOHWUugs4CwPiH"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-aws-mtasts.github_repository.default has moved to module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default
    resource "github_repository" "default" {
        id                          = "terraform-aws-mtasts"
        name                        = "terraform-aws-mtasts"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform-aws-mtasts.github_repository_tag_protection.default has moved to module.ministryofjustice.module.terraform-aws-mtasts.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165192"
        # (2 unchanged attributes hidden)
    }

  # module.terraform-aws-mtasts.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:terraform-aws-mtasts"
        # (4 unchanged attributes hidden)
    }

  # module.terraform-github-repository.github_branch_protection.default has moved to module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOLELUgs4CwzoY"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-github-repository.github_repository.default has moved to module.ministryofjustice.module.terraform-github-repository.github_repository.default
    resource "github_repository" "default" {
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-github-repository.github_repository_tag_protection.default has moved to module.ministryofjustice.module.terraform-github-repository.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "166200"
        # (2 unchanged attributes hidden)
    }

  # module.terraform-github-repository.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:terraform-github-repository"
        # (4 unchanged attributes hidden)
    }

  # module.terraform-template-poc.github_branch_protection.default has moved to module.ministryofjustice.module.terraform-template-poc.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOJKjnDs4CwPiD"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-template-poc.github_repository.default has moved to module.ministryofjustice.module.terraform-template-poc.github_repository.default
    resource "github_repository" "default" {
        id                          = "terraform-template-poc"
        name                        = "terraform-template-poc"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.terraform-template-poc.github_repository_tag_protection.default has moved to module.ministryofjustice.module.terraform-template-poc.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "165190"
        # (2 unchanged attributes hidden)
    }

  # module.terraform-template-poc.github_team_repository.admin["4192115"] has moved to module.ministryofjustice.module.terraform-template-poc.github_team_repository.admin["4192115"]
    resource "github_team_repository" "admin" {
        id         = "4192115:terraform-template-poc"
        # (4 unchanged attributes hidden)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-tamf-repo-2"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"] will be created
  + resource "github_team_repository" "maintain" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "test-tamf-repo-2"
      + team_id    = "4192115"
    }

  # module.test-repo-levg.github_branch_protection.default has moved to module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default
    resource "github_branch_protection" "default" {
        id                              = "BPR_kwDOLPRAVc4CyGYH"
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.test-repo-levg.github_repository.default has moved to module.ministryofjustice-test.module.test-repo-levg.github_repository.default
    resource "github_repository" "default" {
        id                          = "test-repo-levg"
        name                        = "test-repo-levg"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.test-repo-levg.github_repository_tag_protection.default has moved to module.ministryofjustice-test.module.test-repo-levg.github_repository_tag_protection.default
    resource "github_repository_tag_protection" "default" {
        id         = "168994"
        # (2 unchanged attributes hidden)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Test repo to test new module input team_access • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-tamf-repo-test-org"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository_tag_protection.default will be created
  + resource "github_repository_tag_protection" "default" {
      + id                = (known after apply)
      + pattern           = "*"
      + repository        = (known after apply)
      + tag_protection_id = (known after apply)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"] will be created
  + resource "github_team_repository" "maintain" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "test-tamf-repo-test-org"
      + team_id    = "9456244"
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"] will be created
  + resource "github_team_repository" "push" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "test-tamf-repo-test-org"
      + team_id    = "9472191"
    }

Plan: 9 to add, 2 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```